HamedJafarzadeh/LPC1768_Samples/Free-RTOS on LPC1768/LPC17xx-FreeRTOS-CoIDESource/main.c
#include "lpc17xx.h"
#include "R2T-ECA-LPC1768Config.h"
/* FreeRTOS.org includes. */
#include "FreeRTOS.h"
#include "task.h"

#include "HjDelay.h"
/* Used as a loop counter to create a very crude delay. */
#define mainDELAY_LOOP_COUNT		( 0xfffff )

/* The task functions. */
void vTask1( void *pvParameters );
void vTask2( void *pvParameters );

/*-----------------------------------------------------------*/


int main( void )
{
	ECALPC1768Init();
	/* Create one of the two tasks. */
	//cpu_
	//TogglePORT(LEDPORT,LED1PIN);
	xTaskCreate(	vTask1,		/* Pointer to the function that implements the task. */
					"Task 1",	/* Text name for the task.  This is to facilitate debugging only. */
					240,		/* Stack depth in words. */
					NULL,		/* We are not using the task parameter. */
					1,			/* This task will run at priority 1. */
					NULL );		/* We are not using the task handle. */

	/* Create the other task in exactly the same way. */
	xTaskCreate( vTask2, "Task 2", 240, NULL, 2, NULL );

	/* Start the scheduler so our tasks start executing. */
	vTaskStartScheduler();

	/* If all is well we will never reach here as the scheduler will now be
	running.  If we do reach here then it is likely that there was insufficient
	heap available for the idle task to be created. */
	for( ;; );
	return 0;
}
/*-----------------------------------------------------------*/

void vTask1( void *pvParameters )
{
	for( ;; )
  {
	  TogglePORT(LEDPORT,LED2PIN);
	  vTaskDelay( 250 / portTICK_RATE_MS );
  }
}
/*-----------------------------------------------------------*/

void vTask2( void *pvParameters )
{
	for( ;; )
  {
	  TogglePORT(LEDPORT,LED5PIN);
	  vTaskDelay( 250 / portTICK_RATE_MS );
  }
}
/*-----------------------------------------------------------*/

void vApplicationMallocFailedHook( void )
{
	/* This function will only be called if an API call to create a task, queue
	or semaphore fails because there is too little heap RAM remaining. */
	for( ;; );

}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( xTaskHandle *pxTask, signed char *pcTaskName )
{
	/* This function will only be called if a task overflows its stack.  Note
	that stack overflow checking does slow down the context switch
	implementation. */
	for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationIdleHook( void )
{

}
/*-----------------------------------------------------------*/

void vApplicationTickHook( void )
{

}
